In [2]:
import pandas as pd

In [93]:
df=pd.read_csv("summer.csv")

In [5]:
df

       Year    City      Sport  ... Gender                       Event   Medal
0      1896  Athens   Aquatics  ...    Men              100M Freestyle    Gold
1      1896  Athens   Aquatics  ...    Men              100M Freestyle  Silver
2      1896  Athens   Aquatics  ...    Men  100M Freestyle For Sailors  Bronze
3      1896  Athens   Aquatics  ...    Men  100M Freestyle For Sailors    Gold
4      1896  Athens   Aquatics  ...    Men  100M Freestyle For Sailors  Silver
...     ...     ...        ...  ...    ...                         ...     ...
31160  2012  London  Wrestling  ...    Men                    Wg 84 KG  Bronze
31161  2012  London  Wrestling  ...    Men                    Wg 96 KG    Gold
31162  2012  London  Wrestling  ...    Men                    Wg 96 KG  Silver
31163  2012  London  Wrestling  ...    Men                    Wg 96 KG  Bronze
31164  2012  London  Wrestling  ...    Men                    Wg 96 KG  Bronze

[31165 rows x 9 columns]

**1. In how many cities Summer Olympics is held so far?**

In [11]:
df['City'].unique()                          #defines unique cities
no_of_cities=len(df['City'].unique())        #finds total no.of cities
print(no_of_cities)

22

**2. Which sport is having most number of Gold Medals so far? (Top 5)**

In [59]:
a=df.loc[df['Medal']=='Gold','Sport']
sport=pd.DataFrame(a)
data=[]
for i in sport['Sport'].unique():
  data.append([i,len(sport[sport['Sport']==i])])
data=pd.DataFrame(data,columns=['Sport','No_of_Gold'])
data.sort_values(by='No_of_Gold',ascending=False).head()

         Sport  No_of_Gold
0     Aquatics        1421
1    Athletics        1215
17      Rowing         890
4   Gymnastics         820
3      Fencing         552

**3. Which sport is having most number of medals so far?(Top 5)**

In [64]:
t_medals=[]
for i in df['Sport'].unique():
  t_medals.append([i,len(df[df['Sport']==i])])
t_medals=pd.DataFrame(t_medals,columns=['Sport','Total_medals'])
t_medals.sort_values(by='Total_medals',ascending=False).head()

         Sport  Total_medals
0     Aquatics          4170
1    Athletics          3638
17      Rowing          2667
4   Gymnastics          2307
3      Fencing          1613

**4. Which player has won most number of medals? (Top 5)**

In [ ]:
most_medals=[]
for i in df['Athlete'].unique():
  most_medals.append([i,len(df[df['Athlete']==i])])

In [79]:
most_medals=pd.DataFrame(most_medals,columns=['Athlete','most_medals'])
most_medals.sort_values(by='most_medals',ascending=False).head()

                    Athlete  most_medals
18640       PHELPS, Michael           22
7197       LATYNINA, Larisa           18
9948     ANDRIANOV, Nikolay           15
6591           ONO, Takashi           13
5103   MANGIAROTTI, Edoardo           13

**5. Which player has won most number Gold Medals of medals? (Top 5)**

In [89]:
p=df.loc[df['Medal']=='Gold','Athlete']
p=pd.DataFrame(p)
gold_palyers=[]
for i in p['Athlete'].unique():
  gold_palyers.append([i,len(p[p['Athlete']==i])])
gold_palyers=pd.DataFrame(gold_palyers,columns=['Athlete','No_of_golds'])
gold_palyers.sort_values(by='No_of_golds',ascending=False).head()

               Athlete  No_of_golds
6851   PHELPS, Michael           18
3320       SPITZ, Mark            9
2714  LATYNINA, Larisa            9
4630       LEWIS, Carl            9
907       NURMI, Paavo            9

**6. In which year India won first Gold Medal in Summer Olympics?**

**7. Which event is most popular in terms on number of players? (Top 5)**

In [116]:
t_players=[]
for i in df['Event'].unique():
  t_players.append([i,len(df.loc[df['Event']==i,'Athlete'])])
t_players=pd.DataFrame(t_players,columns=['Event','total_palyers'])
t_players.sort_values(by='total_palyers',ascending=False).head()

                Event  total_palyers
80           Football           1497
176            Hockey           1422
138  Team Competition           1147
327        Basketball           1012
337          Handball            973

**8. Which sport is having most female Gold Medalists? (Top 5)**

In [127]:
f_sport=df.loc[df['Gender']=='Women','Sport']
f_sport=pd.DataFrame(f_sport)
f_sport
t_females=[]
for i in f_sport['Sport'].unique():
  t_females.append([i,len(f_sport[f_sport['Sport']==i])])
t_females=pd.DataFrame(t_females,columns=['Sport','Total_FemP'])
t_females.sort_values(by='Total_FemP',ascending=False).head()

         Sport  Total_FemP
4     Aquatics        1726
8    Athletics        1163
9   Gymnastics         799
14      Rowing         651
11  Volleyball         497